NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/BGM22/BGM220PC22WGA.svd
        <register>
          <name>ASYNC_CH10_CTRL</name>
          <description>No Description</description>
          <addressOffset>0x040</addressOffset>
          <access>read-write</access>
          <resetValue>0x000C0000</resetValue>
          <resetMask>0x0F0F7F07</resetMask>
          <fields>
            <field>
              <name>SIGSEL</name>
              <description>Signal Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOURCESEL</name>
              <description>Source Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FNSEL</name>
              <description>Function Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOGICAL_ZERO</name>
                  <description>Logical 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_NOR_B</name>
                  <description>A NOR B</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A_AND_B</name>
                  <description>(!A) AND B</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A</name>
                  <description>!A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_AND_NOT_B</name>
                  <description>A AND (!B)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_B</name>
                  <description>!B</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_XOR_B</name>
                  <description>A XOR B</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_NAND_B</name>
                  <description>A NAND B</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_AND_B</name>
                  <description>A AND B</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_XNOR_B</name>
                  <description>A XNOR B</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>B</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A_OR_B</name>
                  <description>(!A) OR B</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>A</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_OR_NOT_B</name>
                  <description>A OR (!B)</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_OR_B</name>
                  <description>A OR B</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOGICAL_ONE</name>
                  <description>Logical 1</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUXSEL</name>
              <description>Auxiliary LUT Input Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNC_CH11_CTRL</name>
          <description>No Description</description>
          <addressOffset>0x044</addressOffset>
          <access>read-write</access>
          <resetValue>0x000C0000</resetValue>
          <resetMask>0x0F0F7F07</resetMask>
          <fields>
            <field>
              <name>SIGSEL</name>
              <description>Signal Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOURCESEL</name>
              <description>Source Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FNSEL</name>
              <description>Function Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOGICAL_ZERO</name>
                  <description>Logical 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_NOR_B</name>
                  <description>A NOR B</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A_AND_B</name>
                  <description>(!A) AND B</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A</name>
                  <description>!A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_AND_NOT_B</name>
                  <description>A AND (!B)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_B</name>
                  <description>!B</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_XOR_B</name>
                  <description>A XOR B</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_NAND_B</name>
                  <description>A NAND B</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_AND_B</name>
                  <description>A AND B</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_XNOR_B</name>
                  <description>A XNOR B</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>B</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A_OR_B</name>
                  <description>(!A) OR B</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>A</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_OR_NOT_B</name>
                  <description>A OR (!B)</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_OR_B</name>
                  <description>A OR B</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOGICAL_ONE</name>
                  <description>Logical 1</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUXSEL</name>
              <description>Auxiliary LUT Input Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC_CH0_CTRL</name>
          <description>No Description</description>
          <addressOffset>0x048</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007F07</resetMask>
          <fields>
            <field>
              <name>SIGSEL</name>
              <description>Signal Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOURCESEL</name>
              <description>Source Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC_CH1_CTRL</name>
          <description>No Description</description>
          <addressOffset>0x04C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007F07</resetMask>
          <fields>
            <field>
              <name>SIGSEL</name>
              <description>Signal Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOURCESEL</name>
              <description>Source Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC_CH2_CTRL</name>
          <description>No Description</description>
          <addressOffset>0x050</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007F07</resetMask>
          <fields>
            <field>
              <name>SIGSEL</name>
              <description>Signal Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOURCESEL</name>
              <description>Source Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC_CH3_CTRL</name>
          <description>No Description</description>
          <addressOffset>0x054</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007F07</resetMask>
          <fields>
            <field>
              <name>SIGSEL</name>
              <description>Signal Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOURCESEL</name>
              <description>Source Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_CMU_CALDN</name>
          <description>CALDN Consumer Register</description>
          <addressOffset>0x058</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>CALDN async channel select </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_CMU_CALUP</name>
          <description>CALUP Consumer Register</description>
          <addressOffset>0x05C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>CALUP async channel select </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_IADC0_SCANTRIGGER</name>
          <description>SCAN Consumer Register</description>
          <addressOffset>0x064</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000030F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>SCAN async channel select </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPRSSEL</name>
              <description>SCAN sync channel select </description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_IADC0_SINGLETRIGGER</name>
          <description>SINGLE Consumer Register</description>
          <addressOffset>0x068</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000030F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>SINGLE async channel select </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPRSSEL</name>
              <description>SINGLE sync channel select </description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_LDMAXBAR_DMAREQ0</name>
          <description>DMAREQ0 Consumer Register</description>
          <addressOffset>0x06C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>DMAREQ0 async channel select </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_LDMAXBAR_DMAREQ1</name>
          <description>DMAREQ1 Consumer Register</description>
          <addressOffset>0x070</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>DMAREQ1 async channel select </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_LETIMER0_CLEAR</name>
          <description>CLEAR Consumer Register</description>
          <addressOffset>0x074</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>CLEAR async channel select </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_LETIMER0_START</name>
          <description>START Consumer Register</description>
          <addressOffset>0x078</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>START async channel select </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_LETIMER0_STOP</name>
          <description>STOP Consumer Register</description>
          <addressOffset>0x07C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>STOP async channel select </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_EUART0_RX</name>
          <description>RX Consumer Register</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>RX async channel select </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_EUART0_TRIGGER</name>
          <description>TRIGGER Consumer Register</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>TRIGGER async channel select </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_MODEM_DIN</name>
          <description>DIN Consumer Register</description>
          <addressOffset>0x088</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>DIN async channel select </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_RAC_CLR</name>
          <description>CLR Consumer Register</description>
          <addressOffset>0x0C0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>CLR async channel select </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_RAC_CTIIN0</name>
          <description>CTI Consumer Register</description>
          <addressOffset>0x0C4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>CTI async channel select </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_RAC_CTIIN1</name>
          <description>CTI Consumer Register</description>
          <addressOffset>0x0C8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>CTI async channel select </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_RAC_CTIIN2</name>
          <description>CTI Consumer Register</description>
          <addressOffset>0x0CC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>CTI async channel select </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
